
#Здесь записываются все юспользуемые тензоры
#Так же здесь уже записаны тензоры, которые использовались для проверки работоспособности программы для моего варианта (3)

Ajkl = {'comp':['j','k','l'],'vals':[[[1,2,3],[4,5,6],[7,8,9]],[[1,2,3],[4,5,6],[7,8,9]],[[1,2,3],[4,5,6],[7,8,9]]]}

eps = {'comp':['i','j','k'],'vals':[[[0,0,0],[0,0,1],[0,-1,0]],[[0,0,-1],[0,0,0],[1,0,0]],[[0,1,0],[-1,0,0],[0,0,0]]]} #Символ Леви-Чевиты

BK = {'comp':['i','j'],'vals':[[1,0,0],[0,1,0],[0,0,1]]} #Дельта Кронекера

Bjl = {'comp':['j','l'],'vals':[[1,2,3],[4,5,6],[7,8,9]]}

Aij = {'comp':['i','j'],'vals':[[1,2,3],[4,5,6],[7,8,9]]}

Akl = {'comp':['k','l'],'vals':[[1,2,3],[4,5,6],[7,8,9]]}

Tljl = {'comp':['l','j','l'],'vals':[[[1,2,3],[4,5,6],[7,8,9]],[[1,2,3],[4,5,6],[7,8,9]],[[1,2,3],[4,5,6],[7,8,9]]]}

bj = {'comp':['j'],'vals':[1,2,3]}

bl = {'comp':['l'],'vals':[1,2,3]}

bk = {'comp':['k'],'vals':[1,2,3]}

aj = {'comp':['j'],'vals':[1,2,3]}

Bk = {'comp':['k'],'vals':[1,2,3]}

Dimentions = 3 #не тестировалось с другими значениями